I'm also seeing this issue. I have not changed anything in my configuration but it is forcing a replace each time. 
plan: 

Terraform Version: 1.3.9
AWS Provider Version: 4.50.0
```
  # module.msk.aws_mskconnect_connector.src_connector[0] must be replaced
-/+ resource "aws_mskconnect_connector" "src_connector" {
      ~ arn                        = "arn:aws:kafkaconnect:us-east-1:***:connector/dlp-compcare-connector-ccdemo-src-dev/****-2" -> (known after apply)
      ~ id                         = "arn:aws:kafkaconnect:us-east-1:***:connector/dlp-compcare-connector-ccdemo-src-dev/****-2" -> (known after apply)
        name                       = "dlp-compcare-connector-ccdemo-src-dev"
      ~ service_execution_role_arn = "arn:aws:iam::***:role/dlp-compcare-msk-connect-src-connector-role-dev" -> (known after apply) # forces replacement
      ~ version                    = "******" -> (known after apply)
        # (2 unchanged attributes hidden)

      - plugin { # forces replacement
          - custom_plugin {
              - arn      = "arn:aws:kafkaconnect:us-east-1:***:custom-plugin/dlp-mssql-src-plugin/****-2" -> null
              - revision = 1 -> null
            }
        }
      + plugin { # forces replacement
          + custom_plugin {
              + arn      = (known after apply)
              + revision = (known after apply)
            }
        }

        # (6 unchanged blocks hidden)
    }
```
The custom_plugin and service_execution_role_arn are data looks but that shouldn't cause the resource to be replaced. 
@justinretzolk I tried to review the `bug report template` but it's a dead link